// 汎用変数やで(*'v'*)
    var generalOrder = ["1st", "2nd", "3rd", "4th", "5th", "6th"];
    var generalOrder_Length = generalOrder.length;
    var arrayDay = ["月", "火", "水", "木", "金", "土", "日"];
    var arrayDay_Length = arrayDay.length;
    var arrayDayId = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"];
    var arrayDayId_Length = arrayDayId.length;

// 艦載機ページ用やで(*'v'*)
    var arrayKansaiki =
    {
        "リスト":
        {
            "艦種":
            [
                "戦艦",
                "航空戦艦",
                "正規空母",
                "装甲空母",
                "軽空母",
                "水上機母艦",
                "航空巡洋艦",
                "重巡洋艦",
                "潜水空母",
                "揚陸艦",
                "潜水母艦",
                "補給艦"
            ],
            "艦娘":
            {
                "戦艦":
                [
                    "長門改",
                    "陸奥改",
                    "大和改",
                    "武蔵改",
                    "Italia",
                    "Roma改",
                ],
                "航空戦艦":
                [
                    "扶桑改二",
                    "扶桑改",
                    "山城改二",
                    "山城改",
                    "伊勢改",
                    "日向改",
                ],
                "正規空母":
                [
                    "赤城改",
                    "赤城",
                    "加賀改",
                    "加賀",
                    "蒼龍改二",
                    "蒼龍改",
                    "蒼龍",
                    "飛龍改二",
                    "飛龍改",
                    "飛龍",
                    "翔鶴改二",
                    "翔鶴改",
                    "翔鶴",
                    "瑞鶴改二",
                    "瑞鶴改",
                    "瑞鶴",
                    "雲龍改",
                    "雲龍",
                    "天城改",
                    "天城",
                    "葛城改",
                    "葛城",
                    "Graf Zeppelin改",
                    "Graf Zeppelin"
                ],
                "装甲空母":
                [
                    "翔鶴改二甲",
                    "瑞鶴改二甲",
                    "大鳳改",
                    "大鳳",
                ],
                "軽空母":
                [
                    "鳳翔改",
                    "鳳翔",
                    "龍驤改二",
                    "龍驤改",
                    "龍驤",
                    "龍鳳改",
                    "龍鳳",
                    "祥鳳改",
                    "祥鳳",
                    "瑞鳳改",
                    "瑞鳳",
                    "飛鷹改",
                    "飛鷹",
                    "隼鷹改二",
                    "隼鷹改",
                    "隼鷹",
                    "千歳航改二",
                    "千歳航改",
                    "千歳航",
                    "千代田航改二",
                    "千代田航改",
                    "千代田航",
                ],
                "水上機母艦":
                [
                    "千歳甲",
                    "千歳改",
                    "千歳",
                    "千代田甲",
                    "千代田改",
                    "千代田",
                    "瑞穂",
                    "秋津洲改",
                    "秋津洲",
                ],
                "航空巡洋艦":
                [
                    "最上改",
                    "三隈改",
                    "鈴谷改",
                    "熊野改",
                    "利根改二",
                    "筑摩改二",
                ],
                "重巡洋艦":
                [
                    "Zara改",
                    "Pola改",
                ],
                "潜水空母":
                [
                    "伊8改",
                    "伊19改",
                    "伊58改",
                    "伊401改",
                    "伊401",
                ],
                "揚陸艦":
                [
                    "あきつ丸改",
                ],
                "潜水母艦":
                [
                    "大鯨",
                ],
                "補給艦":
                [
                    "速吸改",
                    "速吸",
                ]
            },
            "機種":
            [
                "艦上戦闘機",
                "艦上爆撃機",
                "艦上攻撃機",
                "艦上偵察機",
                "水上偵察機",
                "水上爆撃機",
                "水上戦闘機",
                "大型飛行艇",
                "対潜哨戒機"
            ],
            "艦載機":
            {
                "艦上戦闘機":
                [
                    "九六式艦戦",
                    "零式艦戦21型",
                    "零式艦戦32型",
                    "零式艦戦52型",
                    "零式艦戦32型(熟練)",
                    "Bf109T改",
                    "零式艦戦21型(熟練)",
                    "紫電改二",
                    "零戦52型丙(六〇一空)",
                    "零式艦戦52型(熟練)",
                    "零戦21型(付岩本小隊)",
                    "烈風",
                    "Fw190T改",
                    "零戦52型丙(付岩井小隊)",
                    "烈風(六〇一空)",
                    "零戦52型甲(付岩本小隊)",
                    "烈風改",
                    "零式艦戦53型(岩本隊)",
                    "震電改"
                ],
                "艦上爆撃機":
                [
                    "零式艦戦62型(爆戦)",
                    "零戦62型(爆戦/岩井隊)",
                    "九九式艦爆",
                    "九九式艦爆(熟練)",
                    "彗星",
                    "Ju87C改",
                    "彗星一二型甲",
                    "九九式艦爆(江草隊)",
                    "彗星(六〇一空)",
                    "試製南山",
                    "彗星(江草隊)"
                ],
                "艦上攻撃機":
                [
                    "九七式艦攻",
                    "九七式艦攻(九三一空)",
                    "天山",
                    "九七式艦攻(熟練)",
                    "天山(九三一空)",
                    "流星",
                    "天山(六〇一空)",
                    "九七式艦攻(友永隊)",
                    "九七式艦攻(村田隊)",
                    "流星改",
                    "流星(六〇一空)",
                    "天山一二型(友永隊)",
                    "天山一二型(村田隊)"
                ],
                "艦上偵察機":
                [
                    "二式艦上偵察機",
                    "彩雲",
                    "試製景雲(艦偵型)"
                ],
                "水上偵察機":
                [
                    "九八式水上偵察機(夜偵)",
                    "Ro.43水偵",
                    "零式水上偵察機",
                    "Ar196改",
                    "OS2U",
                    "零式水上観測機",
                    "紫雲"
                ],
                "水上爆撃機":
                [
                    "瑞雲",
                    "瑞雲(六三四空)",
                    "瑞雲12型",
                    "瑞雲12型(六三四空)",
                    "試製晴嵐"
                ],
                "水上戦闘機":
                [
                    "Ro.44水上戦闘機",
                    "二式水戦改"
                ],
                "大型飛行艇":
                [
                    "二式大艇",
                    "PBY-5A Catalina"
                ],
                "対潜哨戒機":
                [
                    "三式指揮連絡機(対潜)",
                    "カ号観測機",
                ]
            },
            "改修値":
            [
                "★0",
                "★1",
                "★2",
                "★3",
                "★4",
                "★5",
                "★6",
                "★7",
                "★8",
                "★9",
                "★10",
            ],
            "熟練度":
            [
                "-",
                "|",
                "||",
                "|||",
                "/",
                "//",
                "///",
                ">>"
            ]
        },
        "艦娘":
        {
            "戦艦":
            {
                "長門改":
                {
                    "スロット1":3, "スロット2":3, "スロット3":3, "スロット4":3
                },
                "陸奥改":
                {
                    "スロット1":3, "スロット2":3, "スロット3":3, "スロット4":3
                },
                "大和改":
                {
                    "スロット1":7, "スロット2":7, "スロット3":7, "スロット4":7
                },
                "武蔵改":
                {
                    "スロット1":7, "スロット2":7, "スロット3":7, "スロット4":7
                },
                "Italia":
                {
                    "スロット1":3, "スロット2":3, "スロット3":3, "スロット4":3
                },
                "Roma改":
                {
                    "スロット1":3, "スロット2":3, "スロット3":3, "スロット4":3
                },
            },
            "航空戦艦":
            {
                "扶桑改二":
                {
                    "スロット1":4, "スロット2":4, "スロット3":9, "スロット4":23
                },
                "扶桑改":
                {
                    "スロット1":10, "スロット2":10, "スロット3":10, "スロット4":10
                },
                "山城改二":
                {
                    "スロット1":4, "スロット2":4, "スロット3":9, "スロット4":23
                },
                "山城改":
                {
                    "スロット1":10, "スロット2":10, "スロット3":10, "スロット4":10
                },
                "伊勢改":
                {
                    "スロット1":11, "スロット2":11, "スロット3":11, "スロット4":14
                },
                "日向改":
                {
                    "スロット1":11, "スロット2":11, "スロット3":11, "スロット4":14
                }
            },
            "正規空母":
            {
                "赤城改":
                {
                    "スロット1":20, "スロット2":20, "スロット3":32, "スロット4":10
                },
                "赤城":
                {
                    "スロット1":18, "スロット2":18, "スロット3":27, "スロット4":10
                },
                "加賀改":
                {
                    "スロット1":20, "スロット2":20, "スロット3":46, "スロット4":12
                },
                "加賀":
                {
                    "スロット1":18, "スロット2":18, "スロット3":45, "スロット4":12
                },
                "蒼龍改二":
                {
                    "スロット1":18, "スロット2":35, "スロット3":20, "スロット4":6
                },
                "蒼龍改":
                {
                    "スロット1":18, "スロット2":27, "スロット3":18, "スロット4":10
                },
                "蒼龍":
                {
                    "スロット1":12, "スロット2":27, "スロット3":18, "スロット4":7
                },
                "飛龍改二":
                {
                    "スロット1":18, "スロット2":36, "スロット3":22, "スロット4":3
                },
                "飛龍改":
                {
                    "スロット1":18, "スロット2":27, "スロット3":18, "スロット4":10
                },
                "飛龍":
                {
                    "スロット1":12, "スロット2":27, "スロット3":18, "スロット4":7
                },
                "翔鶴改二":
                {
                    "スロット1":27, "スロット2":27, "スロット3":27, "スロット4":12
                },
                "翔鶴改":
                {
                    "スロット1":24, "スロット2":24, "スロット3":24, "スロット4":12
                },
                "翔鶴":
                {
                    "スロット1":21, "スロット2":21, "スロット3":21, "スロット4":12
                },
                "瑞鶴改二":
                {
                    "スロット1":28, "スロット2":26, "スロット3":26, "スロット4":13
                },
                "瑞鶴改":
                {
                    "スロット1":24, "スロット2":24, "スロット3":24, "スロット4":12
                },
                "瑞鶴":
                {
                    "スロット1":21, "スロット2":21, "スロット3":21, "スロット4":12
                },
                "雲龍改":
                {
                    "スロット1":18, "スロット2":21, "スロット3":27, "スロット4":3
                },
                "雲龍":
                {
                    "スロット1":18, "スロット2":24, "スロット3":3, "スロット4":6
                },
                "天城改":
                {
                    "スロット1":18, "スロット2":21, "スロット3":27, "スロット4":3
                },
                "天城":
                {
                    "スロット1":18, "スロット2":24, "スロット3":3, "スロット4":6
                },
                "葛城改":
                {
                    "スロット1":18, "スロット2":21, "スロット3":27, "スロット4":3
                },
                "葛城":
                {
                    "スロット1":18, "スロット2":24, "スロット3":3, "スロット4":6
                }
            },
            "装甲空母":
            {
                "翔鶴改二甲":
                {
                    "スロット1":34, "スロット2":21, "スロット3":12, "スロット4":9
                },
                "瑞鶴改二甲":
                {
                    "スロット1":34, "スロット2":24, "スロット3":12, "スロット4":6
                },
                "大鳳改":
                {
                    "スロット1":30, "スロット2":24, "スロット3":24, "スロット4":8
                },
                "大鳳":
                {
                    "スロット1":18, "スロット2":18, "スロット3":18, "スロット4":7
                }
            },
            "軽空母":
            {
                "鳳翔改":
                {
                    "スロット1":14, "スロット2":16, "スロット3":12, "スロット4":0
                },
                "鳳翔":
                {
                    "スロット1":8, "スロット2":11, "スロット3":0, "スロット4":0
                },
                "龍驤改二":
                {
                    "スロット1":18, "スロット2":28, "スロット3":6, "スロット4":3
                },
                "龍驤改":
                {
                    "スロット1":9, "スロット2":24, "スロット3":5, "スロット4":5
                },
                "龍驤":
                {
                    "スロット1":9, "スロット2":24, "スロット3":5, "スロット4":0
                },
                "龍鳳改":
                {
                    "スロット1":21, "スロット2":9, "スロット3":9, "スロット4":6
                },
                "龍鳳":
                {
                    "スロット1":18, "スロット2":7, "スロット3":6, "スロット4":0
                },
                "祥鳳改":
                {
                    "スロット1":18, "スロット2":12, "スロット3":12, "スロット4":6
                },
                "祥鳳":
                {
                    "スロット1":18, "スロット2":9, "スロット3":3, "スロット4":0
                },
                "瑞鳳改":
                {
                    "スロット1":18, "スロット2":12, "スロット3":12, "スロット4":6
                },
                "瑞鳳":
                {
                    "スロット1":18, "スロット2":9, "スロット3":3, "スロット4":0
                },
                "飛鷹改":
                {
                    "スロット1":18, "スロット2":18, "スロット3":18, "スロット4":12
                },
                "飛鷹":
                {
                    "スロット1":12, "スロット2":18, "スロット3":18, "スロット4":10
                },
                "隼鷹改二":
                {
                    "スロット1":24, "スロット2":18, "スロット3":20, "スロット4":4
                },
                "隼鷹改":
                {
                    "スロット1":18, "スロット2":18, "スロット3":18, "スロット4":12
                },
                "隼鷹":
                {
                    "スロット1":12, "スロット2":18, "スロット3":18, "スロット4":10
                },
                "千歳航改二":
                {
                    "スロット1":24, "スロット2":16, "スロット3":11, "スロット4":8
                },
                "千歳航改":
                {
                    "スロット1":24, "スロット2":16, "スロット3":8, "スロット4":8
                },
                "千歳航":
                {
                    "スロット1":21, "スロット2":9, "スロット3":6, "スロット4":0
                },
                "千代田航改二":
                {
                    "スロット1":24, "スロット2":16, "スロット3":11, "スロット4":8
                },
                "千代田航改":
                {
                    "スロット1":24, "スロット2":16, "スロット3":8, "スロット4":8
                },
                "千代田航":
                {
                    "スロット1":21, "スロット2":9, "スロット3":6, "スロット4":0
                }
            },
            "水上機母艦":
            {
                "千歳甲":
                {
                    "スロット1":12, "スロット2":6, "スロット3":6, "スロット4":0
                },
                "千歳改":
                {
                    "スロット1":12, "スロット2":6, "スロット3":6, "スロット4":0
                },
                "千歳":
                {
                    "スロット1":12, "スロット2":12, "スロット3":0, "スロット4":0
                },
                "千代田甲":
                {
                    "スロット1":12, "スロット2":6, "スロット3":6, "スロット4":0
                },
                "千代田改":
                {
                    "スロット1":12, "スロット2":6, "スロット3":6, "スロット4":0
                },
                "千代田":
                {
                    "スロット1":12, "スロット2":12, "スロット3":0, "スロット4":0
                },
                "瑞穂改":
                {
                    "スロット1":12, "スロット2":12, "スロット3":8, "スロット4":0
                },
                "瑞穂":
                {
                    "スロット1":12, "スロット2":12, "スロット3":0, "スロット4":0
                },
                "秋津洲改":
                {
                    "スロット1":1, "スロット2":1, "スロット3":1, "スロット4":0
                },
                "秋津洲":
                {
                    "スロット1":1, "スロット2":1, "スロット3":0, "スロット4":0
                }
            },
            "航空巡洋艦":
            {
                "最上改":
                {
                    "スロット1":5, "スロット2":6, "スロット3":5, "スロット4":11
                },
                "三隈改":
                {
                    "スロット1":5, "スロット2":6, "スロット3":5, "スロット4":8
                },
                "鈴谷改":
                {
                    "スロット1":5, "スロット2":6, "スロット3":5, "スロット4":6
                },
                "熊野改":
                {
                    "スロット1":5, "スロット2":6, "スロット3":5, "スロット4":6
                },
                "利根改二":
                {
                    "スロット1":2, "スロット2":2, "スロット3":9, "スロット4":5
                },
                "筑摩改二":
                {
                    "スロット1":2, "スロット2":2, "スロット3":9, "スロット4":5
                }
            },
            "重巡洋艦":
            {
                "Zara改":
                {
                    "スロット1":2, "スロット2":2, "スロット3":2, "スロット4":2
                },
                "Pola改":
                {
                    "スロット1":2, "スロット2":2, "スロット3":2, "スロット4":2
                }
            },
            "潜水空母":
            {
                "伊8改":
                {
                    "スロット1":1, "スロット2":1, "スロット3":0, "スロット4":0
                },
                "伊19改":
                {
                    "スロット1":1, "スロット2":1, "スロット3":0, "スロット4":0
                },
                "伊58改":
                {
                    "スロット1":1, "スロット2":1, "スロット3":0, "スロット4":0
                },
                "伊401改":
                {
                    "スロット1":3, "スロット2":3, "スロット3":0, "スロット4":0
                },
                "伊401":
                {
                    "スロット1":3, "スロット2":0, "スロット3":0, "スロット4":0
                }
            },
            "揚陸艦":
            {
                "あきつ丸改":
                {
                    "スロット1":8, "スロット2":8, "スロット3":8, "スロット4":0
                }
            },
            "潜水母艦":
            {
                "大鯨":
                {
                    "スロット1":2, "スロット2":3, "スロット3":3, "スロット4":0
                }
            },
            "補給艦":
            {
                "速吸改":
                {
                    "スロット1":6, "スロット2":3, "スロット3":1, "スロット4":0
                },
                "速吸":
                {
                    "スロット1":6, "スロット2":1, "スロット3":0, "スロット4":0
                },
            }
        },
        "艦載機":
        {
            "艦上戦闘機":
            {
                "九六式艦戦":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":2, "対潜":0, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":3
                },
                "零式艦戦21型":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":5, "対潜":0, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":7
                },
                "零式艦戦32型":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":5, "対潜":0, "索敵":0, "命中":0, "回避":2, "装甲":0, "射程":0
                },
                "零式艦戦52型":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":6, "対潜":0, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":6
                },
                "零式艦戦32型(熟練)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":8, "対潜":0, "索敵":0, "命中":1, "回避":4, "装甲":0, "射程":0
                },
                "Bf109T改":
                {
                    "火力":1, "雷装":0, "爆装":0, "対空":8, "対潜":0, "索敵":0, "命中":0, "回避":4, "装甲":0, "射程":2
                },
                "零式艦戦21型(熟練)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":8, "対潜":0, "索敵":1, "命中":2, "回避":2, "装甲":0, "射程":7
                },
                "紫電改二":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":9, "対潜":0, "索敵":0, "命中":0, "回避":3, "装甲":0, "射程":3
                },
                "零戦52型丙(六○一空)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":9, "対潜":0, "索敵":0, "命中":1, "回避":1, "装甲":0, "射程":6
                },
                "零式艦戦52型(熟練)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":9, "対潜":0, "索敵":1, "命中":1, "回避":2, "装甲":0, "射程":6
                },
                "零戦21型(付岩本小隊)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":9, "対潜":0, "索敵":1, "命中":1, "回避":3, "装甲":0, "射程":7
                },
                "烈風":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":10, "対潜":0, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":5
                },
                "Fw190T改":
                {
                    "火力":2, "雷装":0, "爆装":0, "対空":10, "対潜":0, "索敵":0, "命中":0, "回避":2, "装甲":0, "射程":3
                },
                "零戦52型丙(付岩井小隊)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":10, "対潜":0, "索敵":1, "命中":1, "回避":2, "装甲":0, "射程":6
                },
                "烈風(六○一空)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":11, "対潜":0, "索敵":0, "命中":1, "回避":2, "装甲":0, "射程":5
                },
                "零戦52型甲(付岩井小隊)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":11, "対潜":0, "索敵":1, "命中":1, "回避":3, "装甲":0, "射程":6
                },
                "烈風改":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":12, "対潜":0, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":5
                },
                "零式艦戦53型(岩本隊)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":12, "対潜":0, "索敵":3, "命中":2, "回避":4, "装甲":0, "射程":6
                },
                "震電改":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":15, "対潜":0, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":2
                }
            },
            "艦上爆撃機":
            {
                "零式艦戦62型(爆戦)":
                {
                    "火力":0, "雷装":0, "爆装":4, "対空":4, "対潜":3, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":4
                },
                "零戦62型(爆戦/岩井隊)":
                {
                    "火力":0, "雷装":0, "爆装":4, "対空":7, "対潜":3, "索敵":1, "命中":1, "回避":2, "装甲":0, "射程":5
                },
                "九九式艦爆":
                {
                    "火力":0, "雷装":0, "爆装":5, "対空":0, "対潜":3, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":4
                },
                "九九式艦爆(熟練)":
                {
                    "火力":0, "雷装":0, "爆装":7, "対空":1, "対潜":4, "索敵":2, "命中":2, "回避":0, "装甲":0, "射程":4
                },
                "彗星":
                {
                    "火力":0, "雷装":0, "爆装":8, "対空":0, "対潜":3, "索敵":0, "命中":0, "回避":0, "装甲":0, "射程":4
                },
                "Ju87C改":
                {
                    "火力":0, "雷装":0, "爆装":9, "対空":0, "対潜":5, "索敵":0, "命中":1, "回避":0, "装甲":0, "射程":4
                },
                "彗星一二型甲":
                {
                    "火力":0, "雷装":0, "爆装":10, "対空":0, "対潜":3, "索敵":1, "命中":0, "回避":0, "装甲":0, "射程":5
                },
                "九九式艦爆(江草隊)":
                {
                    "火力":0, "雷装":0, "爆装":10, "対空":0, "対潜":5, "索敵":3, "命中":4, "回避":0, "装甲":0, "射程":4
                },
                "彗星(六○一空)":
                {
                    "火力":0, "雷装":0, "爆装":11, "対空":0, "対潜":4, "索敵":1, "命中":1, "回避":0, "装甲":0, "射程":5
                },
                "試製南山":
                {
                    "火力":0, "雷装":0, "爆装":11, "対空":1, "対潜":4, "索敵":2, "命中":0, "回避":0, "装甲":0, "射程":5
                },
                "彗星(江草隊)":
                {
                    "火力":0, "雷装":0, "爆装":13, "対空":1, "対潜":5, "索敵":4, "命中":4, "回避":0, "装甲":0, "射程":5
                }
            },
            "艦上攻撃機":
            {
                "九七式艦攻":
                {
                    "火力":0, "雷装":5, "爆装":0, "対空":0, "対潜":4, "索敵":1, "命中":0, "回避":0, "装甲":0, "射程":4
                },
                "九七式艦攻(九三一空)":
                {
                    "火力":0, "雷装":6, "爆装":0, "対空":0, "対潜":7, "索敵":2, "命中":0, "回避":0, "装甲":0, "射程":4
                },
                "天山":
                {
                    "火力":0, "雷装":7, "爆装":0, "対空":0, "対潜":3, "索敵":1, "命中":0, "回避":0, "装甲":0, "射程":5
                },
                "九七式艦攻(熟練)":
                {
                    "火力":0, "雷装":8, "爆装":0, "対空":0, "対潜":5, "索敵":2, "命中":2, "回避":0, "装甲":0, "射程":4
                },
                "天山(九三一空)":
                {
                    "火力":0, "雷装":9, "爆装":0, "対空":0, "対潜":8, "索敵":2, "命中":0, "回避":0, "装甲":0, "射程":5
                },
                "流星":
                {
                    "火力":0, "雷装":10, "爆装":0, "対空":0, "対潜":4, "索敵":1, "命中":0, "回避":0, "装甲":0, "射程":6
                },
                "天山(六○一空)":
                {
                    "火力":0, "雷装":10, "爆装":0, "対空":0, "対潜":4, "索敵":2, "命中":1, "回避":0, "装甲":0, "射程":5
                },
                "九七式艦攻(友永隊)":
                {
                    "火力":0, "雷装":11, "爆装":0, "対空":1, "対潜":5, "索敵":4, "命中":3, "回避":0, "装甲":0, "射程":4
                },
                "九七式艦攻(村田隊)":
                {
                    "火力":0, "雷装":12, "爆装":0, "対空":1, "対潜":5, "索敵":4, "命中":2, "回避":0, "装甲":0, "射程":4
                },
                "流星改":
                {
                    "火力":0, "雷装":13, "爆装":0, "対空":0, "対潜":3, "索敵":2, "命中":0, "回避":0, "装甲":0, "射程":6
                },
                "流星(六○一空)":
                {
                    "火力":0, "雷装":13, "爆装":0, "対空":0, "対潜":5, "索敵":3, "命中":1, "回避":0, "装甲":0, "射程":6
                },
                "天山一二型(友永隊)":
                {
                    "火力":0, "雷装":14, "爆装":0, "対空":1, "対潜":6, "索敵":5, "命中":3, "回避":0, "装甲":0, "射程":5
                },
                "天山一二型(村田隊)":
                {
                    "火力":0, "雷装":15, "爆装":0, "対空":1, "対潜":6, "索敵":4, "命中":2, "回避":0, "装甲":0, "射程":5
                }
            },
            "艦上偵察機":
            {
                "二式艦上偵察機":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":1, "対潜":0, "索敵":7, "命中":3, "回避":0, "装甲":0, "射程":5
                },
                "彩雲":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":0, "対潜":0, "索敵":9, "命中":2, "回避":0, "装甲":0, "射程":8
                },
                "試製景雲(艦偵型)":
                {
                    "火力":2, "雷装":0, "爆装":0, "対空":0, "対潜":0, "索敵":11, "命中":2, "回避":0, "装甲":0, "射程":8
                }
            },
            "水上偵察機":
            {
                "九八式水上偵察機(夜偵)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":0, "対潜":1, "索敵":3, "命中":1, "回避":0, "装甲":0, "射程":6
                },
                "Ro.43水偵":
                {
                    "火力":1, "雷装":0, "爆装":0, "対空":1, "対潜":2, "索敵":4, "命中":2, "回避":1, "装甲":0, "射程":3
                },
                "零式水上偵察機":
                {
                    "火力":0, "雷装":0, "爆装":1, "対空":1, "対潜":2, "索敵":5, "命中":1, "回避":0, "装甲":0, "射程":7
                },
                "Ar196改":
                {
                    "火力":0, "雷装":0, "爆装":1, "対空":1, "対潜":5, "索敵":5, "命中":2, "回避":0, "装甲":0, "射程":3
                },
                "OS2U":
                {
                    "火力":0, "雷装":0, "爆装":1, "対空":1, "対潜":1, "索敵":6, "命中":2, "回避":1, "装甲":0, "射程":3
                },
                "零式水上観測機":
                {
                    "火力":0, "雷装":0, "爆装":1, "対空":2, "対潜":4, "索敵":6, "命中":2, "回避":0, "装甲":0, "射程":3
                },
                "紫雲":
                {
                    "火力":0, "雷装":0, "爆装":1, "対空":0, "対潜":2, "索敵":8, "命中":1, "回避":0, "装甲":0, "射程":4
                }
            },
            "水上爆撃機":
            {
                "瑞雲":
                {
                    "火力":0, "雷装":0, "爆装":4, "対空":2, "対潜":4, "索敵":6, "命中":1, "回避":0, "装甲":0, "射程":5
                },
                "瑞雲(六三四空)":
                {
                    "火力":0, "雷装":0, "爆装":6, "対空":2, "対潜":5, "索敵":6, "命中":1, "回避":0, "装甲":0, "射程":5
                },
                "瑞雲12型":
                {
                    "火力":0, "雷装":0, "爆装":7, "対空":3, "対潜":5, "索敵":6, "命中":1, "回避":0, "装甲":0, "射程":5
                },
                "瑞雲12型(六三四空)":
                {
                    "火力":0, "雷装":0, "爆装":9, "対空":3, "対潜":6, "索敵":7, "命中":1, "回避":0, "装甲":0, "射程":5
                },
                "試製晴嵐":
                {
                    "火力":0, "雷装":0, "爆装":11, "対空":0, "対潜":6, "索敵":6, "命中":1, "回避":0, "装甲":0, "射程":4
                }
            },
            "水上戦闘機":
            {
                "Ro.44水上戦闘機":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":2, "対潜":1, "索敵":2, "命中":1, "回避":2, "装甲":0, "射程":3
                },
                "二式水戦改":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":3, "対潜":1, "索敵":1, "命中":1, "回避":2, "装甲":0, "射程":4
                },
            },
            "大型飛行艇":
            {
                "二式大艇":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":0, "対潜":1, "索敵":12, "命中":1, "回避":0, "装甲":0, "射程":20
                },
                "PBY-5A Catalina":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":0, "対潜":2, "索敵":9, "命中":2, "回避":0, "装甲":0, "射程":10
                },
            },
            "対潜哨戒機":
            {
                "カ号観測機":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":0, "対潜":9, "索敵":0, "命中":1, "回避":0, "装甲":0, "射程":0
                },
                "三式指揮連絡機(対潜)":
                {
                    "火力":0, "雷装":0, "爆装":0, "対空":0, "対潜":7, "索敵":1, "命中":2, "回避":0, "装甲":0, "射程":0
                }
            }
        }
    };

// 改修ページ用やで(*'v'*)
    var arrayKaishu = 
    {
        "リスト":
        {
            "分類":
            [
                "小口径主砲", 
                "中口径主砲", 
                "大口径主砲", 
                "副砲", 
                "魚雷", 
                "水上偵察機", 
                "小型電探", 
                "大型電探", 
                "ソナー", 
                "爆雷", 
                "徹甲弾", 
                "対空機銃", 
                "高射装置", 
                "上陸用舟艇", 
                "探照灯"
            ], 
            "装備名":
            {
                "小口径主砲":
                [
                    "12.7cm連装砲", 
                    "12.7cm連装砲B型改二", 
                    "10cm高角砲＋高射装置"
                ], 
                "中口径主砲":
                [
                    "14cm単装砲", 
                    "14cm連装砲", 
                    "15.2cm連装砲", 
                    "15.2cm連装砲改", 
                    "15.5cm三連装砲", 
                    "20.3cm連装砲", 
                    "20.3cm(2号)連装砲", 
                    "20.3cm(3号)連装砲"
                ], 
                "大口径主砲":
                [
                    "35.6cm連装砲", 
                    "試製35.6cm三連装砲", 
                    "35.6cm連装砲(ダズル迷彩)", 
                    "38cm連装砲", 
                    "38cm連装砲改", 
                    "381mm/50 三連装砲", 
                    "381mm/50 三連装砲改", 
                    "41cm連装砲", 
                    "試製41cm三連装砲", 
                    "試製46cm連装砲", 
                    "46cm三連装砲", 
                    "試製51cm連装砲"
                ], 
                "副砲":
                [
                    "90mm単装高角砲", 
                    "15.2cm単装砲", 
                    "OTO 152mm三連装速射砲"
                ],
                "魚雷":
                [
                    "61cm三連装魚雷", 
                    "61cm三連装(酸素)魚雷", 
                    "61cm四連装魚雷", 
                    "61cm四連装(酸素)魚雷", 
                    "61cm五連装(酸素)魚雷"
                ], 
                "水上偵察機":
                [
                    "零式水上偵察機", 
                    "零式水上観測機", 
                    "九八式水上偵察機(夜偵)", 
                    "Ro.43水偵"
                ], 
                "小型電探":
                [
                    "13号対空電探", 
                    "13号対空電探改", 
                    "22号対水上電探", 
                    "22号対水上電探改四"
                ], 
                "大型電探":
                [
                    "21号対空電探", 
                    "21号対空電探改", 
                    "32号対水上電探", 
                    "32号対水上電探改"
                ], 
                "ソナー":
                [
                    "九三式水中聴音機", 
                    "九三式水中聴音機", 
                    "三式水中探信儀", 
                    "四式水中聴音機"
                ], 
                "爆雷":
                [
                    "九四式爆雷投射機", 
                    "三式爆雷投射機"
                ], 
                "徹甲弾":
                [
                    "九一式徹甲弾", 
                    "一式徹甲弾"
                ],
                "対空機銃":
                [
                    "25mm単装機銃", 
                    "25mm連装機銃", 
                    "25mm三連装機銃"
                ], 
                "高射装置":
                [
                    "91式高射装置", 
                    "94式高射装置", 
                    "94式高射装置"
                ], 
                "上陸用舟艇":
                [
                    "大発動艇", 
                    "大発動艇(八九式中戦車＆陸戦隊)", 
                    "特二式内火艇"
                ], 
                "探照灯":
                [
                    "探照灯", 
                    "96式150cm探照灯"
                ]
            }
        },
        "小口径主砲":
        {
            "12.7cm連装砲":{
                "燃":10, "弾":30, "鋼":60, "ボ":0, 
                 "☆0":{"開発":[1, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[1, 2], "改修":[1, 2], "装備": 1, "装備名": "12.7cm連装砲"},
                "☆10":{"開発":[2, 3], "改修":[3, 6], "装備": 2, "装備名": "12.7cm連装砲", "次": "12.7cm連装砲B型改二"},
                "月":["-"], 
                "火":["-"], 
                "水":["-"], 
                "木":["-"], 
                "金":["-"], 
                "土":["-"], 
                "日":["-"], 
            },
            "12.7cm連装砲B型改二":{
                "燃":10, "弾":40, "鋼":70, "ボ":0, 
                 "☆0":{"開発":[2, 2], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[2, 4], "装備": 1, "装備名": "12.7cm連装砲B型改二"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["夕立改二", "綾波改二"], 
                "火":["夕立改二", "綾波改二"], 
                "水":["夕立改二", "綾波改二"], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
            "10cm高角砲＋高射装置":{
                "燃":10, "弾":60, "鋼":150, "ボ":50, 
                 "☆0":{"開発":[6, 7], "改修":[3, 4], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[5, 8], "改修":[4, 7], "装備": 2, "装備名": "10cm連装高角砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["秋月", "初月"], 
                "火":["秋月", "初月"], 
                "水":["秋月", "初月"], 
                "木":["秋月", "照月", "初月"], 
                "金":["照月"], 
                "土":["照月"], 
                "日":["照月"], 
            },
        },      
        "中口径主砲":
        {
            "14cm単装砲":{
                "燃":10, "弾":50, "鋼":80, "ボ":0, 
                 "☆0":{"開発":[1, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[1, 2], "改修":[1, 2], "装備": 1, "装備名": "14cm単装砲"},
                "☆10":{"開発":[3, 4], "改修":[3, 6], "装備": 2, "装備名": "14cm単装砲", "次": "14cm連装砲"},
                "月":["-"], 
                "火":["-"], 
                "水":["-"], 
                "木":["-"], 
                "金":["-"], 
                "土":["-"], 
                "日":["-"], 
            },
            "14cm連装砲":{
                "燃":10, "弾":60, "鋼":100, "ボ":0, 
                 "☆0":{"開発":[2, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 4], "改修":[2, 3], "装備": 1, "装備名": "14cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["夕張"], 
                "火":[-1], 
                "水":[-1], 
                "木":["夕張"], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
            "15.2cm連装砲":{
                "燃":10, "弾":70, "鋼":100, "ボ":0, 
                 "☆0":{"開発":[2, 2], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[2, 4], "装備": 1, "装備名": "15.2cm連装砲"},
                "☆10":{"開発":[5, 8], "改修":[4, 10], "装備": 1, "装備名": "22号対水上電探", "次": "15.2cm連装砲改"},
                "月":["能代", "矢矧"], 
                "火":["矢矧"], 
                "水":["矢矧"], 
                "木":["阿賀野", "矢矧"], 
                "金":["阿賀野", "能代"], 
                "土":["阿賀野", "能代"], 
                "日":["能代"], 
            },
            "15.2cm連装砲改":{
                "燃":20, "弾":80, "鋼":100, "ボ":30, 
                 "☆0":{"開発":[3, 4], "改修":[2, 3], "装備": 1, "装備名": "15.2cm連装砲"},
                 "☆6":{"開発":[4, 6], "改修":[3, 6], "装備": 1, "装備名": "15.2cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["酒匂"], 
                "火":["酒匂"], 
                "水":["矢矧"], 
                "木":["矢矧"], 
                "金":["矢矧"], 
                "土":["矢矧", "酒匂"], 
                "日":["酒匂"], 
            },
            "15.5cm三連装砲":{
                "燃":10, "弾":90, "鋼":120, "ボ":0, 
                 "☆0":{"開発":[2, 2], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[2, 4], "装備": 1, "装備名": "15.5cm三連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["大淀"], 
                "火":[-1], 
                "水":[-1], 
                "木":[-1], 
                "金":["最上"], 
                "土":["最上"], 
                "日":["大淀"], 
            },
            "20.3cm連装砲":{
                "燃":10, "弾":90, "鋼":120, "ボ":0, 
                 "☆0":{"開発":[1, 2], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[2, 3], "装備": 1, "装備名": "20.3cm連装砲"},
                "☆10":{"開発":[2, 5], "改修":[4, 10], "装備": 2, "装備名": "20.3cm連装砲", "次": "20.3cm(2号)連装砲"},
                "月":["衣笠"], 
                "火":["衣笠"], 
                "水":["衣笠"], 
                "木":["青葉", "衣笠"], 
                "金":["青葉", "衣笠"], 
                "土":["青葉", "衣笠"], 
                "日":["青葉", "衣笠"], 
            },
            "20.3cm(2号)連装砲":{
                "燃":10, "弾":100, "鋼":130, "ボ":0, 
                 "☆0":{"開発":[2, 3], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 4], "改修":[2, 4], "装備": 1, "装備名": "20.3cm(2号)連装砲"},
                "☆10":{"開発":[4, 8], "改修":[4, 11], "装備": 1, "装備名": "20.3cm(2号)連装砲", "次": "20.3cm(3号)連装砲"},
                "月":["妙高"], 
                "火":["妙高"], 
                "水":[-1], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":["妙高"], 
            },
            "20.3cm(3号)連装砲":{
                "燃":10, "弾":110, "鋼":140, "ボ":0, 
                 "☆0":{"開発":[3, 4], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 5], "改修":[3, 5], "装備": 1, "装備名": "20.3cm(3号)連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":["三隈"], 
                "水":["三隈"], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
        },      
        "大口径主砲":
        {
            "35.6cm連装砲":{
                "燃":20, "弾":240, "鋼":300, "ボ":0, 
                 "☆0":{"開発":[2, 3], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 4], "改修":[2, 4], "装備": 1, "装備名": "35.6cm連装砲"},
                "☆10":{"開発":[6, 12], "改修":[5, 12], "装備": 3, "装備名": "35.6cm連装砲", "次": "試製35.6cm三連装砲"},
                "月":[-1], 
                "火":[-1], 
                "水":[-1], 
                "木":[-1], 
                "金":["扶桑"], 
                "土":["扶桑"], 
                "日":["扶桑"], 
            },
            "試製35.6cm三連装砲":{
                "燃":30, "弾":330, "鋼":390, "ボ":30, 
                 "☆0":{"開発":[4, 6], "改修":[3, 4], "装備": 2, "装備名": "35.6cm連装砲"},
                 "☆6":{"開発":[6, 9], "改修":[4, 7], "装備": 3, "装備名": "35.6cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":[-1], 
                "水":["金剛改二", "扶桑改二"], 
                "木":["金剛改二", "榛名改二", "扶桑改二", "山城改二"], 
                "金":["榛名改二", "扶桑改二", "山城改二"], 
                "土":["扶桑改二", "山城改二"], 
                "日":["山城改二"], 
            },
            "35.6cm連装砲(ダズル迷彩)":{
                "燃":30, "弾":250, "鋼":300, "ボ":30, 
                 "☆0":{"開発":[3, 4], "改修":[2, 3], "装備": 1, "装備名": "35.6cm連装砲"},
                 "☆6":{"開発":[4, 5], "改修":[3, 5], "装備": 2, "装備名": "35.6cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["榛名改二"], 
                "火":["榛名改二"], 
                "水":["榛名改二"], 
                "木":[-1], 
                "金":[-1], 
                "土":["榛名改二"], 
                "日":["榛名改二"], 
            },
            "38cm連装砲":{
                "燃":20, "弾":380, "鋼":450, "ボ":20, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 1, "装備名": "35.6cm連装砲"},
                 "☆6":{"開発":[5, 8], "改修":[3, 5], "装備": 2, "装備名": "35.6cm連装砲"},
                "☆10":{"開発":[10, 20], "改修":[6, 13], "装備": 2, "装備名": "41cm連装砲", "次": "38cm連装砲改☆3"},
                "月":[-1], 
                "火":[-1], 
                "水":[-1], 
                "木":["Bismarck"], 
                "金":["Bismarck"], 
                "土":["Bismarck"], 
                "日":[-1], 
            },
            "38cm連装砲改":{
                "燃":30, "弾":390, "鋼":470, "ボ":30, 
                 "☆0":{"開発":[5, 7], "改修":[3, 4], "装備": 1, "装備名": "41cm連装砲"},
                 "☆6":{"開発":[6, 9], "改修":[4, 6], "装備": 2, "装備名": "41cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["Bismarck"], 
                "火":["Bismarck"], 
                "水":[-1], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":["Bismarck"], 
            },
            "381mm/50 三連装砲":{
                "燃":30, "弾":400, "鋼":480, "ボ":20, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 1, "装備名": "35.6cm連装砲"},
                 "☆6":{"開発":[5, 8], "改修":[3, 5], "装備": 2, "装備名": "35.6cm連装砲"},
                "☆10":{"開発":[12, 22], "改修":[7, 14], "装備": 2, "装備名": "25mm連装機銃", "次": "381mm／50 三連装砲改☆3"},
                "月":["Roma"], 
                "火":["Littorio"], 
                "水":["Littorio"], 
                "木":["Littorio"], 
                "金":["Littorio"], 
                "土":["Roma"], 
                "日":["Roma"], 
            },
            "381mm/50 三連装砲改":{
                "燃":40, "弾":440, "鋼":500, "ボ":40, 
                 "☆0":{"開発":[5, 7], "改修":[3, 4], "装備": 1, "装備名": "41cm連装砲"},
                 "☆6":{"開発":[7, 10], "改修":[4, 6], "装備": 2, "装備名": "41cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["Littorio"], 
                "火":["Roma"], 
                "水":["Roma"], 
                "木":["Roma"], 
                "金":["Roma"], 
                "土":["Littorio"], 
                "日":["Littorio"], 
            },
            "41cm連装砲":{
                "燃":30, "弾":350, "鋼":480, "ボ":0, 
                 "☆0":{"開発":[3, 4], "改修":[2, 3], "装備": 1, "装備名": "41cm連装砲"},
                 "☆6":{"開発":[4, 7], "改修":[3, 6], "装備": 2, "装備名": "41cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["陸奥"], 
                "火":["長門"], 
                "水":[-1], 
                "木":["陸奥"], 
                "金":["長門"], 
                "土":["長門"], 
                "日":["陸奥"], 
            },
            "試製41cm三連装砲":{
                "燃":40, "弾":440, "鋼":620, "ボ":40, 
                 "☆0":{"開発":[5, 7], "改修":[4, 6], "装備": 2, "装備名": "41cm連装砲"},
                 "☆6":{"開発":[8, 10], "改修":[5, 8], "装備": 3, "装備名": "41cm連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["長門改"], 
                "火":["陸奥改"], 
                "水":["長門改", "陸奥改"], 
                "木":["長門改"], 
                "金":["陸奥改"], 
                "土":["陸奥改"], 
                "日":["長門改"], 
            },
            "試製46cm連装砲":{
                "燃":40, "弾":420, "鋼":650, "ボ":40, 
                 "☆0":{"開発":[5, 6], "改修":[3, 5], "装備": 2, "装備名": "41cm連装砲"},
                 "☆6":{"開発":[6, 8], "改修":[4, 7], "装備": 3, "装備名": "41cm連装砲"},
                "☆10":{"開発":[12, 18], "改修":[8, 14], "装備": 4, "装備名": "41cm連装砲", "次": "46cm三連装砲☆5"},
                "月":["大和"], 
                "火":["武蔵"], 
                "水":["武蔵"], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":["大和"], 
            },
            "46cm三連装砲":{
                "燃":50, "弾":480, "鋼":800, "ボ":50, 
                 "☆0":{"開発":[6, 8], "改修":[4, 6], "装備": 1, "装備名": "46cm三連装砲"},
                 "☆6":{"開発":[8, 10], "改修":[5, 8], "装備": 2, "装備名": "46cm三連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["武蔵"], 
                "火":[-1], 
                "水":[-1], 
                "木":[-1], 
                "金":["大和"], 
                "土":["大和"], 
                "日":["武蔵"], 
            },
            "試製51cm連装砲":{
                "燃":50, "弾":550, "鋼":950, "ボ":80, 
                 "☆0":{"開発":[7, 9], "改修":[5, 7], "装備": 2, "装備名": "46cm三連装砲"},
                 "☆6":{"開発":[10, 15], "改修":[7, 10], "装備": 3, "装備名": "46cm三連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["大和改", "武蔵改"], 
                "火":["大和改"], 
                "水":["武蔵改"], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
        },       
        "副砲":
        {
            "90mm単装高角砲":{
                "燃":10, "弾":20, "鋼":70, "ボ":10, 
                 "☆0":{"開発":[1, 2], "改修":[1, 2], "装備": 1, "装備名": "10cm連装高角砲"},
                 "☆6":{"開発":[2, 3], "改修":[1, 2], "装備": 2, "装備名": "10cm連装高角砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["Littorio"], 
                "火":["Littorio"], 
                "水":["Littorio"], 
                "木":["Littorio", "Roma"], 
                "金":["Roma"], 
                "土":["Roma"], 
                "日":["Roma"], 
            },
            "15.2cm単装砲":{
                "燃":10, "弾":60, "鋼":90, "ボ":0, 
                 "☆0":{"開発":[2, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[2, 3], "装備": 1, "装備名": "15.2cm連装砲"},
                "☆10":{"開発":[3, 4], "改修":[3, 5], "装備": 2, "装備名": "15.2cm連装砲", "次": "15.2cm連装砲"},
                "月":["阿賀野", "金剛", "山城"], 
                "火":["阿賀野", "山城"], 
                "水":["山城"], 
                "木":[-1], 
                "金":[-1], 
                "土":["金剛"], 
                "日":["阿賀野", "金剛"], 
            },
            "OTO 152mm三連装速射砲":{
                "燃":10, "弾":90, "鋼":120, "ボ":0, 
                 "☆0":{"開発":[2, 3], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 4], "改修":[3, 5], "装備": 1, "装備名": "15.5cm三連装砲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["Roma"], 
                "火":["Littorio"], 
                "水":["Littorio"], 
                "木":["Roma"], 
                "金":["Roma"], 
                "土":["Littorio"], 
                "日":["Littorio", "Roma"], 
            },
        },	   
        "魚雷":
        {
            "61cm三連装魚雷":{
                "燃":50, "弾":70, "鋼":60, "ボ":20, 
                 "☆0":{"開発":[1, 2], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[1, 2], "装備": 1, "装備名": "61cm三連装魚雷"},
                "☆10":{"開発":[3, 5], "改修":[2, 4], "装備": 2, "装備名": "61cm三連装魚雷", "次": "61cm三連装(酸素)魚雷"},
                "月":["叢雲"], 
                "火":["叢雲"], 
                "水":[-1], 
                "木":["吹雪"], 
                "金":["吹雪"], 
                "土":["吹雪"], 
                "日":["叢雲"], 
            },
            "61cm三連装(酸素)魚雷":{
                "燃":60, "弾":90, "鋼":60, "ボ":20, 
                 "☆0":{"開発":[1, 2], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 5], "改修":[1, 3], "装備": 1, "装備名": "61cm三連装魚雷"},
                "☆10":{"開発":[4, 8], "改修":[3, 6], "装備": 2, "装備名": "61cm四連装魚雷", "次": "61cm四連装(酸素)魚雷☆5"},
                "月":[-1], 
                "火":[-1], 
                "水":[-1], 
                "木":["吹雪改二"], 
                "金":["吹雪改二"], 
                "土":["吹雪改二"], 
                "日":[-1], 
            },
            "61cm四連装魚雷":{
                "燃":70, "弾":100, "鋼":70, "ボ":20, 
                 "☆0":{"開発":[1, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[1, 2], "装備": 1, "装備名": "61cm四連装魚雷"},
                "☆10":{"開発":[3, 5], "改修":[3, 6], "装備": 2, "装備名": "61cm四連装魚雷", "次": "61cm四連装(酸素)魚雷☆3"},
                "月":["-"], 
                "火":["-"], 
                "水":[-1], 
                "木":[-1], 
                "金":["-"], 
                "土":["-"], 
                "日":["-"], 
            },
            "61cm四連装(酸素)魚雷":{
                "燃":80, "弾":120, "鋼":80, "ボ":20, 
                 "☆0":{"開発":[2, 3], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[4, 8], "改修":[2, 4], "装備": 1, "装備名": "61cm四連装(酸素)魚雷"},
                "☆10":{"開発":[5, 10], "改修":[5, 11], "装備": 3, "装備名": "61cm四連装(酸素)魚雷", "次": "61cm五連装(酸素)魚雷"},
                "月":["大井", "北上"], 
                "火":["大井", "北上"], 
                "水":["大井", "北上"], 
                "木":["大井", "北上"], 
                "金":["大井", "北上"], 
                "土":["大井", "北上"], 
                "日":["大井", "北上"], 
            },
            "61cm五連装(酸素)魚雷":{
                "燃":100, "弾":150, "鋼":90, "ボ":30, 
                 "☆0":{"開発":[3, 4], "改修":[3, 5], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[5, 9], "改修":[3, 7], "装備": 1, "装備名": "61cm五連装(酸素)魚雷"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":[-1], 
                "水":["島風"], 
                "木":["島風"], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
        },	   
        "水上偵察機":
        {
            "零式水上偵察機":{
                "燃":90, "弾":20, "鋼":0, "ボ":300, 
                 "☆0":{"開発":[4, 6], "改修":[2, 3], "装備": 1, "装備名": "零式水上偵察機"},
                 "☆6":{"開発":[5, 8], "改修":[3, 5], "装備": 2, "装備名": "零式水上偵察機"},
                "☆10":{"開発":[9, 15], "改修":[5, 10], "装備": 3, "装備名": "零式艦戦21型", "次": "二式水戦改"},
                "月":["瑞穂"], 
                "火":["瑞穂"], 
                "水":["千代田甲"], 
                "木":["千代田甲", "秋津洲改"], 
                "金":["千歳甲", "秋津洲改", "瑞穂"], 
                "土":["千歳甲", "秋津洲改", "瑞穂"], 
                "日":["秋津洲改", "瑞穂"], 
            },
            "零式水上観測機":{
                "燃":90, "弾":40, "鋼":0, "ボ":270, 
                 "☆0":{"開発":[4, 6], "改修":[3, 5], "装備": 1, "装備名": "瑞雲"},
                 "☆6":{"開発":[6, 9], "改修":[4, 7], "装備": 1, "装備名": "瑞雲"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["瑞穂"], 
                "火":["瑞穂"], 
                "水":["瑞穂"], 
                "木":["武蔵"], 
                "金":["武蔵"], 
                "土":["瑞穂", "武蔵"], 
                "日":["瑞穂"], 
            },
            "九八式水上偵察機(夜偵)":{
                "燃":100, "弾":30, "鋼":0, "ボ":480, 
                 "☆0":{"開発":[4, 7], "改修":[3, 4], "装備": 1, "装備名": "零式水上偵察機"},
                 "☆6":{"開発":[5, 9], "改修":[4, 8], "装備": 2, "装備名": "零式水上偵察機"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["川内改二"], 
                "火":[-1], 
                "水":[-1], 
                "木":["川内改二"], 
                "金":["川内改二"], 
                "土":["川内改二"], 
                "日":["川内改二"], 
            },
            "Ro.43水偵":{
                "燃":60, "弾":30, "鋼":0, "ボ":180, 
                 "☆0":{"開発":[3, 5], "改修":[1, 2], "装備": 1, "装備名": "零式水上偵察機"},
                 "☆6":{"開発":[4, 6], "改修":[2, 4], "装備": 1, "装備名": "瑞雲"},
                "☆10":{"開発":[5, 10], "改修":[3, 5], "装備": 2, "装備名": "零式水上偵察機", "次": "Ro.44水上戦闘機"},
                "月":["Zara改"], 
                "火":["Zara改", "Roma改"], 
                "水":["Zara改", "Roma改"], 
                "木":["Zara改"], 
                "金":["Zara改"], 
                "土":["Italia"], 
                "日":["Italia"], 
            },
        },	   
        "小型電探":
        {
            "13号対空電探":{
                "燃":10, "弾":0, "鋼":20, "ボ":30, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[5, 7], "改修":[3, 5], "装備": 1, "装備名": "13号対空電探"},
                "☆10":{"開発":[10, 15], "改修":[5, 12], "装備": 1, "装備名": "21号対空電探", "次": "13号対空電探改"},
                "月":["五十鈴改二", "照月"], 
                "火":["秋月", "照月"], 
                "水":["秋月", "照月"], 
                "木":["時雨改二", "秋月"], 
                "金":["時雨改二", "五十鈴改二"], 
                "土":["時雨改二", "五十鈴改二"], 
                "日":["時雨改二", "五十鈴改二"], 
            },
            "13号対空電探改":{
                "燃":10, "弾":0, "鋼":30, "ボ":40, 
                 "☆0":{"開発":[5, 7], "改修":[3, 4], "装備": 1, "装備名": "13号対空電探"},
                 "☆6":{"開発":[7, 9], "改修":[4, 8], "装備": 2, "装備名": "13号対空電探"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["雪風"], 
                "火":["雪風"], 
                "水":["雪風"], 
                "木":["磯風改"], 
                "金":["磯風改", "初霜改二"], 
                "土":["磯風改", "初霜改二"], 
                "日":["初霜改二", "雪風"], 
            },
            "22号対水上電探":{
                "燃":10, "弾":0, "鋼":30, "ボ":30, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 1, "装備名": "22号対水上電探"},
                 "☆6":{"開発":[7, 10], "改修":[3, 5], "装備": 2, "装備名": "22号対水上電探"},
                "☆10":{"開発":[10, 20], "改修":[8, 14], "装備": 3, "装備名": "22号対水上電探", "次": "22号対水上電探改四"},
                "月":["日向", "夕雲"], 
                "火":["夕雲"], 
                "水":["島風"], 
                "木":["島風"], 
                "金":["日向", "夕雲", "島風"], 
                "土":["日向", "夕雲", "島風"], 
                "日":["日向"], 
            },
            "22号対水上電探改四":{
                "燃":10, "弾":0, "鋼":40, "ボ":40, 
                 "☆0":{"開発":[5, 8], "改修":[3, 4], "装備": 1, "装備名": "22号対水上電探"},
                 "☆6":{"開発":[8, 10], "改修":[4, 8], "装備": 1, "装備名": "22号対水上電探改四"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["羽黒改二"], 
                "火":["金剛改二"], 
                "水":["金剛改二"], 
                "木":["妙高改二", "金剛改二"], 
                "金":["妙高改二", "羽黒改二", "金剛改二"], 
                "土":["妙高改二", "羽黒改二"], 
                "日":["妙高改二", "羽黒改二"], 
            },
        },	   
        "大型電探":
        {
            "21号対空電探":{
                "燃":10, "弾":0, "鋼":40, "ボ":50, 
                 "☆0":{"開発":[5, 6], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[6, 8], "改修":[3, 5], "装備": 1, "装備名": "21号対空電探"},
                "☆10":{"開発":[12, 16], "改修":[5, 13], "装備": 2, "装備名": "21号対空電探", "次": "21号対空電探改"},
                "月":["伊勢"], 
                "火":[-1], 
                "水":["日向"], 
                "木":["日向"], 
                "金":["伊勢", "日向"], 
                "土":["伊勢", "日向"], 
                "日":["伊勢"], 
            },
            "21号対空電探改":{
                "燃":10, "弾":0, "鋼":60, "ボ":70, 
                 "☆0":{"開発":[6, 8], "改修":[2, 3], "装備": 1, "装備名": "21号対空電探"},
                 "☆6":{"開発":[10, 12], "改修":[4, 8], "装備": 2, "装備名": "21号対空電探"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":["武蔵"], 
                "水":["武蔵"], 
                "木":["大和", "武蔵"], 
                "金":["大和", "武蔵"], 
                "土":["大和"], 
                "日":["大和"], 
            },
            "32号対水上電探":{
                "燃":10, "弾":0, "鋼":60, "ボ":50, 
                 "☆0":{"開発":[6, 10], "改修":[3, 4], "装備": 1, "装備名": "22号対水上電探"},
                 "☆6":{"開発":[12, 15], "改修":[4, 7], "装備": 2, "装備名": "22号対水上電探"},
                "☆10":{"開発":[15, 22], "改修":[10, 15], "装備": 1, "装備名": "32号対水上電探", "次": "32号対水上電探改"},
                "月":["日向"], 
                "火":["日向"], 
                "水":["伊勢"], 
                "木":["伊勢"], 
                "金":["伊勢"], 
                "土":["伊勢"], 
                "日":["日向"], 
            },
            "32号対水上電探改":{
                "燃":10, "弾":0, "鋼":100, "ボ":80, 
                 "☆0":{"開発":[10, 15], "改修":[5, 6], "装備": 3, "装備名": "22号対水上電探"},
                 "☆6":{"開発":[14, 18], "改修":[7, 10], "装備": 1, "装備名": "32号対水上電探"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["伊勢"], 
                "火":["伊勢"], 
                "水":["日向"], 
                "木":["日向"], 
                "金":["日向"], 
                "土":["日向"], 
                "日":["伊勢"], 
            },
        },	   
        "ソナー":
        {
            "九三式水中聴音機":{
                "燃":10, "弾":0, "鋼":30, "ボ":30, 
                 "☆0":{"開発":[2, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 4], "改修":[2, 3], "装備": 1, "装備名": "九三式水中聴音機"},
                "☆10":{"開発":[6, 9], "改修":[3, 5], "装備": 2, "装備名": "九三式水中聴音機", "次": "三式水中探信儀☆3"},
                "月":["五十鈴改二"], 
                "火":[-1], 
                "水":[-1], 
                "木":[-1], 
                "金":["夕張"], 
                "土":["夕張"], 
                "日":["夕張"], 
            },
            "九三式水中聴音機":{
                "燃":10, "弾":0, "鋼":30, "ボ":30, 
                 "☆0":{"開発":[2, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 4], "改修":[2, 3], "装備": 1, "装備名": "九三式水中聴音機"},
                "☆10":{"開発":[10, 20], "改修":[6, 12], "装備": 2, "装備名": "三式水中探信儀", "次": "四式水中聴音機"},
                "月":[-1], 
                "火":[-1], 
                "水":[-1], 
                "木":["時雨改二", "五十鈴改二"], 
                "金":["時雨改二", "五十鈴改二", "香取改"], 
                "土":["時雨改二", "香取改"], 
                "日":["時雨改二", "香取改"], 
            },
            "三式水中探信儀":{
                "燃":10, "弾":0, "鋼":30, "ボ":50, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[5, 7], "改修":[3, 5], "装備": 1, "装備名": "三式水中探信儀"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":["夕張", "五十鈴改二"], 
                "水":["夕張", "五十鈴改二"], 
                "木":[-1], 
                "金":[-1], 
                "土":[-1], 
                "日":["五十鈴改二"], 
            },
            "四式水中聴音機":{
                "燃":10, "弾":0, "鋼":50, "ボ":60, 
                 "☆0":{"開発":[5, 7], "改修":[3, 5], "装備": 2, "装備名": "九三式水中聴音機"},
                 "☆6":{"開発":[6, 10], "改修":[4, 6], "装備": 1, "装備名": "四式水中聴音機"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["香取改"], 
                "火":["香取改"], 
                "水":["照月"], 
                "木":["五十鈴改二"], 
                "金":["五十鈴改二"], 
                "土":["五十鈴改二"], 
                "日":["秋月"], 
            },
        },	   
        "爆雷":
        {
            "九四式爆雷投射機":{
                "燃":10, "弾":60, "鋼":20, "ボ":20, 
                 "☆0":{"開発":[1, 2], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[2, 3], "改修":[1, 3], "装備": 1, "装備名": "九四式爆雷投射機"},
                "☆10":{"開発":[3, 6], "改修":[3, 8], "装備": 2, "装備名": "九四式爆雷投射機", "次": "三式爆雷投射機☆3"},
                "月":[-1], 
                "火":[-1], 
                "水":["-"], 
                "木":["-"], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
            "三式爆雷投射機":{
                "燃":10, "弾":80, "鋼":20, "ボ":30, 
                 "☆0":{"開発":[3, 3], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 5], "改修":[2, 4], "装備": 1, "装備名": "三式爆雷投射機"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":[-1], 
                "水":["五十鈴改二"], 
                "木":["五十鈴改二"], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
        },	   
        "徹甲弾":
        {
            "九一式徹甲弾":{
                "燃":30, "弾":150, "鋼":310, "ボ":10, 
                 "☆0":{"開発":[2, 3], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 5], "改修":[1, 2], "装備": 1, "装備名": "九一式徹甲弾"},
                "☆10":{"開発":[6, 9], "改修":[4, 9], "装備": 3, "装備名": "九一式徹甲弾", "次": "一式徹甲弾"},
                "月":["霧島"], 
                "火":[-1], 
                "水":["比叡"], 
                "木":["比叡"], 
                "金":["比叡", "霧島"], 
                "土":["比叡", "霧島"], 
                "日":["霧島"], 
            },
            "一式徹甲弾":{
                "燃":30, "弾":170, "鋼":330, "ボ":20, 
                 "☆0":{"開発":[3, 5], "改修":[1, 1], "装備": 2, "装備名": "九一式徹甲弾"},
                 "☆6":{"開発":[4, 6], "改修":[2, 4], "装備": 1, "装備名": "一式徹甲弾"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["榛名"], 
                "火":["榛名"], 
                "水":["榛名"], 
                "木":[-1], 
                "金":["金剛"], 
                "土":["金剛"], 
                "日":["金剛"], 
            },
        },	   
        "対空機銃":
        {
            "25mm単装機銃":{
                "燃":0, "弾":10, "鋼":10, "ボ":10, 
                 "☆0":{"開発":[0, 1], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[1, 2], "改修":[1, 1], "装備": 1, "装備名": "25mm単装機銃"},
                "☆10":{"開発":[2, 3], "改修":[1, 2], "装備": 1, "装備名": "25mm単装機銃", "次": "25mm連装機銃☆5"},
                "月":[-1], 
                "火":[-1], 
                "水":["文月"], 
                "木":["文月"], 
                "金":["皐月", "文月"], 
                "土":["皐月", "文月"], 
                "日":["皐月"], 
            },
            "25mm連装機銃":{
                "燃":0, "弾":20, "鋼":10, "ボ":10, 
                 "☆0":{"開発":[0, 1], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[1, 2], "改修":[1, 2], "装備": 1, "装備名": "25mm連装機銃"},
                "☆10":{"開発":[2, 3], "改修":[1, 2], "装備": 1, "装備名": "25mm連装機銃", "次": "25mm三連装機銃☆3"},
                "月":["皐月", "文月"], 
                "火":["皐月", "文月"], 
                "水":[-1], 
                "木":[-1], 
                "金":[-1], 
                "土":["五十鈴改二"], 
                "日":["五十鈴改二", "文月"], 
            },
            "25mm三連装機銃":{
                "燃":0, "弾":30, "鋼":20, "ボ":10, 
                 "☆0":{"開発":[1, 2], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[1, 3], "改修":[1, 2], "装備": 1, "装備名": "25mm三連装機銃"},
                "☆10":{"開発":[5, 9], "改修":[3, 7], "装備": 5, "装備名": "25mm三連装機銃", "次": "25mm三連装機銃 集中配備"},
                "月":["五十鈴改二", "摩耶改二"], 
                "火":["五十鈴改二"], 
                "水":["五十鈴改二", "皐月改二"], 
                "木":["皐月改二"], 
                "金":["摩耶改二"], 
                "土":["摩耶改二"], 
                "日":["摩耶改二"], 
            },
            "25mm三連装機銃":{
                "燃":0, "弾":30, "鋼":20, "ボ":10, 
                 "☆0":{"開発":[1, 2], "改修":[1, 1], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[1, 3], "改修":[1, 2], "装備": 1, "装備名": "25mm三連装機銃"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":[-1], 
                "火":["摩耶"], 
                "水":["摩耶"], 
                "木":["摩耶"], 
                "金":[-1], 
                "土":[-1], 
                "日":[-1], 
            },
        },	   
        "高射装置":
        {
            "91式高射装置":{
                "燃":0, "弾":0, "鋼":60, "ボ":40, 
                 "☆0":{"開発":[3, 4], "改修":[1, 2], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 5], "改修":[2, 4], "装備": 1, "装備名": "12.7cm連装高角砲"},
                "☆10":{"開発":[4, 9], "改修":[4, 7], "装備": 2, "装備名": "10cm連装高角砲", "次": "94式高射装置"},
                "月":["摩耶", "秋月"], 
                "火":[-1], 
                "水":[-1], 
                "木":["照月"], 
                "金":["摩耶", "秋月", "照月"], 
                "土":["摩耶", "秋月", "照月"], 
                "日":["摩耶", "秋月", "照月"], 
            },
            "94式高射装置":{
                "燃":0, "弾":0, "鋼":80, "ボ":70, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[4, 6], "改修":[3, 5], "装備": 1, "装備名": "10cm連装高角砲"},
                "☆10":{"開発":[8, 10], "改修":[5, 10], "装備": 2, "装備名": "10cm連装高角砲", "次": "10cm高角砲＋高射装置"},
                "月":["秋月", "照月"], 
                "火":["秋月", "照月"], 
                "水":["秋月", "照月"], 
                "木":["秋月", "照月", "吹雪改二"], 
                "金":["秋月", "照月", "初月", "吹雪改二"], 
                "土":["秋月", "照月", "初月", "吹雪改二"], 
                "日":["秋月", "照月", "初月", "吹雪改二"], 
            },
            "94式高射装置":{
                "燃":0, "弾":0, "鋼":80, "ボ":70, 
                 "☆0":{"開発":[4, 5], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[4, 6], "改修":[3, 5], "装備": 1, "装備名": "12.7cm連装高角砲"},
                "☆10":{"開発":[7, 9], "改修":[5, 9], "装備": 2, "装備名": "12.7cm連装高角砲", "次": "12.7cm高角砲＋高射装置"},
                "月":[-1], 
                "火":[-1], 
                "水":[-1], 
                "木":["摩耶改二"], 
                "金":["摩耶改二"], 
                "土":["摩耶改二"], 
                "日":["摩耶改二"], 
            },
        },	   
        "上陸用舟艇":
        {
            "大発動艇":{
                "燃":50, "弾":30, "鋼":30, "ボ":10, 
                 "☆0":{"開発":[1, 2], "改修":[1, 2], "装備": 1, "装備名": "ドラム缶(輸送用)"},
                 "☆6":{"開発":[1, 4], "改修":[2, 3], "装備": 1, "装備名": "7.7mm機銃"},
                "☆10":{"開発":[4, 8], "改修":[3, 7], "装備": 3, "装備名": "12.7mm単装機銃", "次": "大発動艇(八九式中戦車＆陸戦隊)"},
                "月":["あきつ丸", "皐月改二", "阿武隈改二"], 
                "火":["あきつ丸", "皐月改二"], 
                "水":["あきつ丸", "皐月改二"], 
                "木":["あきつ丸"], 
                "金":["あきつ丸", "阿武隈改二"], 
                "土":["あきつ丸", "阿武隈改二"], 
                "日":["あきつ丸", "皐月改二", "阿武隈改二"], 
            },
            "大発動艇(八九式中戦車＆陸戦隊)":{
                "燃":70, "弾":80, "鋼":120, "ボ":30, 
                 "☆0":{"開発":[3, 5], "改修":[2, 3], "装備": 1, "装備名": "25mm単装機銃"},
                 "☆6":{"開発":[4, 8], "改修":[3, 5], "装備": 2, "装備名": "12cm30連装噴進砲"},
                "☆10":{"開発":[10, 18], "改修":[5, 9], "装備": 3, "装備名": "7.7mm機銃", "次": "特二式内火艇"},
                "月":["あきつ丸"], 
                "火":["阿武隈改二"], 
                "水":["阿武隈改二"], 
                "木":["皐月改二", "阿武隈改二"], 
                "金":["あきつ丸", "皐月改二"], 
                "土":["あきつ丸", "皐月改二"], 
                "日":["あきつ丸"], 
            },
            "特二式内火艇":{
                "燃":80, "弾":90, "鋼":100, "ボ":70, 
                 "☆0":{"開発":[5, 8], "改修":[3, 4], "装備": 2, "装備名": "7.7mm機銃"},
                 "☆6":{"開発":[8, 12], "改修":[4, 6], "装備": 3, "装備名": "12.7mm単装機銃"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["伊58", "伊401"], 
                "火":["伊401"], 
                "水":["伊8", "伊401"], 
                "木":["伊8", "伊401"], 
                "金":["伊58", "伊8"], 
                "土":["伊58", "伊8"], 
                "日":["伊58"], 
            },
        },	   
        "探照灯":
        {
            "探照灯":{
                "燃":10, "弾":0, "鋼":30, "ボ":20, 
                 "☆0":{"開発":[3, 3], "改修":[2, 3], "装備": 0, "装備名": "-"},
                 "☆6":{"開発":[3, 5], "改修":[2, 4], "装備": 1, "装備名": "探照灯"},
                "☆10":{"開発":[5, 10], "改修":[3, 7], "装備": 1, "装備名": "熟練見張員", "次": "96式150cm探照灯"},
                "月":["青葉", "綾波"], 
                "火":["青葉", "綾波"], 
                "水":["青葉", "綾波"], 
                "木":["暁"], 
                "金":["暁", "神通"], 
                "土":["暁", "神通"], 
                "日":["神通"], 
            },
            "96式150cm探照灯":{
                "燃":20, "弾":0, "鋼":70, "ボ":30, 
                 "☆0":{"開発":[4, 5], "改修":[3, 4], "装備": 1, "装備名": "探照灯"},
                 "☆6":{"開発":[5, 10], "改修":[3, 7], "装備": 1, "装備名": "探照灯"},
                "☆10":{"開発":[-1, -1], "改修":[-1, -1], "装備": -1, "装備名": "-", "次": "-"},
                "月":["比叡"], 
                "火":["霧島"], 
                "水":["霧島"], 
                "木":["霧島"], 
                "金":["比叡", "霧島"], 
                "土":["比叡"], 
                "日":["比叡"], 
            },
        }
    };

// 戦闘ページ用やで(*'v'*)
    var arraySentouAA = 
    {
        "リスト":
        [
            "全ての艦種", 
            "戦艦・航空戦艦", 
            "秋月型", 
            "摩耶改二", 
            "五十鈴改二", 
            "霞改二乙", 
            "皐月改二"
        ], 
        "全ての艦種":
        {
            "組み合わせ":
            [
                "高角砲＋高射装置<br />高角砲＋高射装置<br />対空電探", 
                "高角砲＋高射装置<br />対空電探", 
                "高角砲<br />高射装置<br />対空電探", 
                "25mm三連装機銃 集中配備<br />対空機銃<br />対空電探", 
                "高角砲<br />高射装置"
            ], 
            "撃墜数":[4, 4, 3, 3, 2]
        },
        "戦艦・航空戦艦":
        {
            "組み合わせ":
            [
                "大口径主砲<br />三式弾<br />高射装置<br />対空電探", 
                "大口径主砲<br />三式弾<br />高射装置"
            ], 
            "撃墜数":[6, 4]
        },
        "秋月型":
        {
            "組み合わせ":
            [
                "高角砲<br />高角砲<br />電探", 
                "高角砲<br />電探", 
                "高角砲<br />高角砲"
            ], 
            "撃墜数":[7, 6, 4]
        },
        "摩耶改二":
        {
            "組み合わせ":
            [
                "高角砲<br />25mm三連装機銃 集中配備<br />対空電探", 
                "高角砲<br />25mm三連装機銃 集中配備"
            ], 
            "撃墜数":[8, 6]
        },
        "五十鈴改二":
        {
            "組み合わせ":
            [
                "高角砲＋高射装置<br />対空機銃<br />対空電探", 
                "高角砲<br />対空機銃<br />対空電探"
            ], 
            "撃墜数":[3, 3]
        },
        "霞改二乙":
        {
            "組み合わせ":
            [
                "高角砲<br />対空機銃<br />対空電探", 
                "高角砲<br />対空機銃"
            ], 
            "撃墜数":[4, 2]
        },
        "皐月改二":
        {
            "組み合わせ":
            [
                "25mm三連装機銃 集中配備"
            ], 
            "撃墜数":[2]
        },
    };
    var arraySentouOF = 
    {
        "リスト":
        [
            "カットイン", 
            "連撃"
        ], 
        "カットイン":
        {
            "組み合わせ":
            {
                "主砲":[2, 1, 1, "1以上"], 
                "副砲":["-", 1, 1, "1以上"], 
                "徹甲":[1, 1, "-", "-"],
                "電探":["-", "-", 1, "-"], 
                "倍率":["x1.5", "x1.3", "x1.2", "x1.1"]
            }
        },
        "連撃":
        {
            "組み合わせ":
            {
                "主砲":["2以上"],
                "副砲":["-"],
                "徹甲":["-"],
                "電探":["-"],
                "倍率":["x1.2*2"]
            }
        }
    };
    var arraySentouNC = 
    {
        "リスト":
        [
            "カットイン", 
            "連撃"
        ], 
        "カットイン":
        {
            "組み合わせ":
            {
                "主砲":["-", "3以上", 2, 2, 1],  
                "副砲":["-", "-", "1以上", 0, "-"],  
                "魚雷":["2以上", "-", "-", 1, 1], 
                "倍率":["x1.5*2", "x2.0", "x1.75", "x1.3*2", "x1.3*2"]
            }
        },
        "連撃":
        {
            "組み合わせ":
            {
                "主砲":[2, 1, 0],  
                "副砲":[0, "1以上", "2以上"], 
                "魚雷":[0, 0, "0～1"], 
                "倍率":["x1.2*2", "x1.2*2", "x1.2*2"]
            }
        }
    };

// 遠征ページ用やで(*'v'*)
    var arrayEnsei = 
    {
        "リスト":
        {
            "海域":
            [
                "鎮守府海域", 
                "南西諸島海域", 
                "北方海域", 
                "西方海域", 
                "南方海域"
            ], 
            "遠征":
            {
                "鎮守府海域": 
                [
                    "練習航海", 
                    "長距離練習航海", 
                    "警備任務", 
                    "対潜警戒任務", 
                    "海上護衛任務", 
                    "防空射撃演習", 
                    "観艦式予行", 
                    "観艦式"
                ], 
                "南西諸島海域": 
                [
                    "タンカー護衛任務", 
                    "強行偵察任務", 
                    "ボーキサイト輸送任務", 
                    "資源輸送任務", 
                    "鼠輸送作戦", 
                    "包囲陸戦隊撤収作戦", 
                    "囮機動部隊支援作戦", 
                    "艦隊決戦援護作戦"
                ], 
                "北方海域": 
                [
                    "敵地偵察作戦", 
                    "航空機輸送作戦", 
                    "北号作戦", 
                    "潜水艦哨戒任務", 
                    "北方鼠輸送作戦", 
                    "艦隊演習", 
                    "航空戦艦運用演習", 
                    "北方航路海上護衛"
                ],  
                "西方海域": 
                [
                    "通商破壊作戦", 
                    "敵母港空襲作戦", 
                    "潜水艦通商破壊作戦", 
                    "西方海域封鎖作戦", 
                    "潜水艦派遣演習", 
                    "潜水艦派遣作戦", 
                    "海外艦との接触", 
                    "遠洋練習航海"
                ], 
                "南方海域": 
                [
                    "前衛支援任務", 
                    "艦隊決戦支援任務", 
                    "MO作戦", 
                    "水上機基地建設", 
                    "東京急行", 
                    "東京急行（弐）", 
                    "遠洋潜水艦作戦", 
                    "水上機前線輸送"
                ]
            }
        },
        "鎮守府海域":
        {
            "練習航海":
            {
                "基本":{"旗艦Lv":1, "必要隻数":2, "必要艦種":"-", "ドラム缶":"-"},
                "詳細":{"時間":"15m", "提督経験値":10, "艦娘経験値":10, 
                        "燃":"-", "弾":30, "鋼":"-", "ボ":"-", "報酬":["-", "-"], "消費燃":"30%", "消費弾":"0%"
                }
            },
            "長距離練習航海":
            {
                "基本":{"旗艦Lv":2, "必要隻数":4, "必要艦種":"-", "ドラム缶":"-"},
                "詳細":{"時間":"30m", "提督経験値":20, "艦娘経験値":15, 
                        "燃":"-", "弾":100, "鋼":30, "ボ":"-", "報酬":["-", "高速修復材1"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "警備任務":
            {
                "基本":{"旗艦Lv":3, "必要隻数":3, "必要艦種":"-", "ドラム缶":"-"},
                "詳細":{"時間":"20m", "提督経験値":30, "艦娘経験値":30, 
                        "燃":30, "弾":30, "鋼":40, "ボ":"-", "報酬":["-", "-"], "消費燃":"30%", "消費弾":"20%"
                }
            },
            "対潜警戒任務":
            {
                "基本":{"旗艦Lv":3, "必要隻数":3, "必要艦種":"軽巡1駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"50m", "提督経験値":30, "艦娘経験値":40, 
                        "燃":"-", "弾":60, "鋼":"-", "ボ":"-", "報酬":["高速修復材1", "家具箱小1"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "海上護衛任務":
            {
                "基本":{"旗艦Lv":3, "必要隻数":4, "必要艦種":"軽巡1駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"1h30m", "提督経験値":40, "艦娘経験値":40, 
                        "燃":200, "弾":200, "鋼":20, "ボ":20, "報酬":["-", "-"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "防空射撃演習":
            {
                "基本":{"旗艦Lv":4, "必要隻数":4, "必要艦種":"-", "ドラム缶":"-"},
                "詳細":{"時間":"40m", "提督経験値":30, "艦娘経験値":50, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":80, "報酬":["家具箱小1", "-"], "消費燃":"30%", "消費弾":"20%"
                }
            },
            "観艦式予行":
            {
                "基本":{"旗艦Lv":5, "必要隻数":6, "必要艦種":"-", "ドラム缶":"-"},
                "詳細":{"時間":"1h", "提督経験値":60, "艦娘経験値":120, 
                        "燃":"-", "弾":"-", "鋼":50, "ボ":30, "報酬":["建造資材1", "-"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "観艦式":
            {
                "基本":{"旗艦Lv":6, "必要隻数":6, "必要艦種":"-", "ドラム缶":"-"},
                "詳細":{"時間":"3h", "提督経験値":120, "艦娘経験値":140, 
                        "燃":50, "弾":100, "鋼":50, "ボ":50, "報酬":["建造資材2", "開発資材1"], "消費燃":"50%", "消費弾":"20%"
                }
            }
        },
        "南西諸島海域":
        {
            "タンカー護衛任務":
            {
                "基本":{"旗艦Lv":3, "必要隻数":4, "必要艦種":"軽巡1駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"4h", "提督経験値":60, "艦娘経験値":60, 
                        "燃":350, "弾":"-", "鋼":"-", "ボ":"-", "報酬":["家具箱小1", "高速修復材2"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "強行偵察任務":
            {
                "基本":{"旗艦Lv":3, "必要隻数":3, "必要艦種":"軽巡2", "ドラム缶":"-"},
                "詳細":{"時間":"1h30m", "提督経験値":40, "艦娘経験値":50, 
                        "燃":"-", "弾":50, "鋼":"-", "ボ":30, "報酬":["高速修復材1", "建造資材1"], "消費燃":"30%", "消費弾":"0%"
                }
            },
            "ボーキサイト輸送任務":
            {
                "基本":{"旗艦Lv":6, "必要隻数":4, "必要艦種":"駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"5h", "提督経験値":40, "艦娘経験値":40, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":250, "報酬":["家具箱小1", "高速修復材1"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "資源輸送任務":
            {
                "基本":{"旗艦Lv":4, "必要隻数":4, "必要艦種":"駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"8h", "提督経験値":60, "艦娘経験値":50, 
                        "燃":50, "弾":250, "鋼":200, "ボ":50, "報酬":["家具箱中1", "開発資材1"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "鼠輸送作戦":
            {
                "基本":{"旗艦Lv":5, "必要隻数":6, "必要艦種":"軽巡1駆逐4", "ドラム缶":"-"},
                "詳細":{"時間":"4h", "提督経験値":70, "艦娘経験値":60, 
                        "燃":240, "弾":300, "鋼":"-", "ボ":"-", "報酬":["高速修復材2", "家具箱小1"], "消費燃":"50%", "消費弾":"40%"
                }
            },
            "包囲陸戦隊撤収作戦":
            {
                "基本":{"旗艦Lv":6, "必要隻数":6, "必要艦種":"軽巡1駆逐3", "ドラム缶":"-"},
                "詳細":{"時間":"6h", "提督経験値":90, "艦娘経験値":100, 
                        "燃":"-", "弾":240, "鋼":200, "ボ":"-", "報酬":["高速修復材1", "開発資材1"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "囮機動部隊支援作戦":
            {
                "基本":{"旗艦Lv":8, "必要隻数":6, "必要艦種":"空母2駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"12h", "提督経験値":100, "艦娘経験値":160, 
                        "燃":"-", "弾":"-", "鋼":300, "ボ":400, "報酬":["家具箱大1", "開発資材1"], "消費燃":"50%", "消費弾":"40%"
                }
            },
            "艦隊決戦援護作戦":
            {
                "基本":{"旗艦Lv":10, "必要隻数":6, "必要艦種":"軽巡1駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"15h", "提督経験値":120, "艦娘経験値":200, 
                        "燃":500, "弾":500, "鋼":200, "ボ":200, "報酬":["建造資材2", "開発資材2"], "消費燃":"50%", "消費弾":"40%"
                }
            }
        },
        "北方海域":
        {
            "敵地偵察作戦":
            {
                "基本":{"旗艦Lv":20, "必要隻数":6, "必要艦種":"軽巡1駆逐3", "ドラム缶":"-"},
                "詳細":{"時間":"45m", "提督経験値":30, "艦娘経験値":40, 
                        "燃":70, "弾":70, "鋼":50, "ボ":"-", "報酬":["-", "-"], "消費燃":"30%", "消費弾":"40%"
                }
            },
            "航空機輸送作戦":
            {
                "基本":{"旗艦Lv":15, "必要隻数":6, "必要艦種":"空母3駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"5h", "提督経験値":60, "艦娘経験値":60, 
                        "燃":"-", "弾":"-", "鋼":300, "ボ":100, "報酬":["高速修復材1", "-"], "消費燃":"50%", "消費弾":"20%"
                }
            },
            "北号作戦":
            {
                "基本":{"旗艦Lv":20, "必要隻数":6, "必要艦種":"航戦2駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"2h", "提督経験値":40, "艦娘経験値":50, 
                        "燃":"-", "弾":"-", "鋼":150, "ボ":"-", "報酬":["家具箱小1", "開発資材1"], "消費燃":"50%", "消費弾":"40%"
                }
            },
            "潜水艦哨戒任務":
            {
                "基本":{"旗艦Lv":1, "必要隻数":2, "必要艦種":"潜水1軽巡1", "ドラム缶":"-"},
                "詳細":{"時間":"2h", "提督経験値":40, "艦娘経験値":50, 
                        "燃":"-", "弾":"-", "鋼":150, "ボ":"-", "報酬":["開発資材1", "家具箱小1"], "消費燃":"50%", "消費弾":"40%"
                }
            },
            "北方鼠輸送作戦":
            {
                "基本":{"旗艦Lv":15, "必要隻数":5, "必要艦種":"軽巡1駆逐4、合計Lv30", "ドラム缶":"3隻3個"},
                "詳細":{"時間":"2h20m", "提督経験値":45, "艦娘経験値":55, 
                        "燃":320, "弾":270, "鋼":"-", "ボ":"-", "報酬":["家具箱小1", "-"], "消費燃":"80%", "消費弾":"70%"
                }
            },
            "艦隊演習":
            {
                "基本":{"旗艦Lv":30, "必要隻数":6, "必要艦種":"重巡1軽巡1駆逐2、合計Lv45", "ドラム缶":"-"},
                "詳細":{"時間":"3h", "提督経験値":45, "艦娘経験値":400, 
                        "燃":"-", "弾":10, "鋼":"-", "ボ":"-", "報酬":["-", "-"], "消費燃":"80%", "消費弾":"70%"
                }
            },
            "航空戦艦運用演習":
            {
                "基本":{"旗艦Lv":50, "必要隻数":6, "必要艦種":"航戦2駆逐2、合計Lv200", "ドラム缶":"-"},
                "詳細":{"時間":"4h", "提督経験値":70, "艦娘経験値":420, 
                        "燃":"-", "弾":20, "鋼":"-", "ボ":100, "報酬":["-", "-"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "北方航路海上護衛":
            {
                "基本":{"旗艦Lv":50, "必要隻数":6, "必要艦種":"旗艦軽巡1駆逐4、合計Lv200", "ドラム缶":"-"},
                "詳細":{"時間":"8h20m", "提督経験値":65, "艦娘経験値":80, 
                        "燃":500, "弾":"-", "鋼":"-", "ボ":150, "報酬":["開発資材2", "高速修復材1"], "消費燃":"90%", "消費弾":"60%"
                }
            }
        },
        "西方海域": 
        {
            "通商破壊作戦":
            {
                "基本":{"旗艦Lv":25, "必要隻数":4, "必要艦種":"重巡2駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"40h", "提督経験値":80, "艦娘経験値":180, 
                        "燃":900, "弾":"-", "鋼":500, "ボ":"-", "報酬":["-", "-"], "消費燃":"50%", "消費弾":"80%"
                }
            },
            "敵母港空襲作戦":
            {
                "基本":{"旗艦Lv":30, "必要隻数":4, "必要艦種":"空母1軽巡1駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"80h", "提督経験値":80, "艦娘経験値":60, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":900, "報酬":["高速修復材3", "-"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "潜水艦通商破壊作戦":
            {
                "基本":{"旗艦Lv":1, "必要隻数":2, "必要艦種":"潜水2", "ドラム缶":"-"},
                "詳細":{"時間":"20h", "提督経験値":80, "艦娘経験値":60, 
                        "燃":"-", "弾":"-", "鋼":800, "ボ":"-", "報酬":["開発資材1", "家具箱小2"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "西方海域封鎖作戦":
            {
                "基本":{"旗艦Lv":30, "必要隻数":3, "必要艦種":"潜水3", "ドラム缶":"-"},
                "詳細":{"時間":"25h", "提督経験値":100, "艦娘経験値":140, 
                        "燃":"-", "弾":"-", "鋼":900, "ボ":350, "報酬":["開発資材2", "家具箱中2"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "潜水艦派遣演習":
            {
                "基本":{"旗艦Lv":50, "必要隻数":3, "必要艦種":"潜水3", "ドラム缶":"-"},
                "詳細":{"時間":"24h", "提督経験値":100, "艦娘経験値":100, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":100, "報酬":["開発資材1", "家具箱小1"], "消費燃":"90%", "消費弾":"40%"
                }
            },
            "潜水艦派遣作戦":
            {
                "基本":{"旗艦Lv":55, "必要隻数":4, "必要艦種":"潜水4", "ドラム缶":"-"},
                "詳細":{"時間":"48h", "提督経験値":100, "艦娘経験値":150, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":100, "報酬":["開発資材3", "-"], "消費燃":"90%", "消費弾":"70%"
                }
            },
            "海外艦との接触":
            {
                "基本":{"旗艦Lv":60, "必要隻数":4, "必要艦種":"潜水4、合計Lv200", "ドラム缶":"-"},
                "詳細":{"時間":"2h", "提督経験値":50, "艦娘経験値":50, 
                        "燃":"-", "弾":30, "鋼":"-", "ボ":"-", "報酬":["家具箱小1", "-"], "消費燃":"50%", "消費弾":"0%"
                }
            },
            "遠洋練習航海":
            {
                "基本":{"旗艦Lv":5, "必要隻数":3, "必要艦種":"旗艦練巡1駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"24h", "提督経験値":300, "艦娘経験値":"900～", 
                        "燃":50, "弾":50, "鋼":50, "ボ":50, "報酬":["家具箱大1", "開発資材3"], "消費燃":"90%", "消費弾":"30%"
                }
            }
        },
        "南方海域": 
        {
            "前衛支援任務":
            {
                "基本":{"旗艦Lv":1, "必要隻数":2, "必要艦種":"駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"15m", "提督経験値":0, "艦娘経験値":0, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":"-", "報酬":["-", "-"], "消費燃":"50%", "消費弾":"40%～80%"
                }
            },
            "艦隊決戦支援任務":
            {
                "基本":{"旗艦Lv":1, "必要隻数":2, "必要艦種":"駆逐2", "ドラム缶":"-"},
                "詳細":{"時間":"30m", "提督経験値":0, "艦娘経験値":0, 
                        "燃":"-", "弾":"-", "鋼":"-", "ボ":"-", "報酬":["-", "-"], "消費燃":"50%", "消費弾":"40%～80%"
                }
            },
            "MO作戦":
            {
                "基本":{"旗艦Lv":40, "必要隻数":6, "必要艦種":"空母2重巡1駆逐1", "ドラム缶":"-"},
                "詳細":{"時間":"7h", "提督経験値":100, "艦娘経験値":100, 
                        "燃":"-", "弾":"-", "鋼":240, "ボ":280, "報酬":["家具箱小2", "開発資材1"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "水上機基地建設":
            {
                "基本":{"旗艦Lv":30, "必要隻数":6, "必要艦種":"水母2軽巡1駆逐1", "ドラム缶":"-"},
                "詳細":{"時間":"9h", "提督経験値":100, "艦娘経験値":100, 
                        "燃":480, "弾":"-", "鋼":200, "ボ":200, "報酬":["家具箱中2", "高速修復材1"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "東京急行":
            {
                "基本":{"旗艦Lv":50, "必要隻数":6, "必要艦種":"軽巡1駆逐5", "ドラム缶":"3隻4個"},
                "詳細":{"時間":"2h45m", "提督経験値":50, "艦娘経験値":65, 
                        "燃":"-", "弾":380, "鋼":270, "ボ":"-", "報酬":["家具箱小1", "-"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "東京急行（弐）":
            {
                "基本":{"旗艦Lv":65, "必要隻数":6, "必要艦種":"駆逐5", "ドラム缶":"4隻8個"},
                "詳細":{"時間":"2h55m", "提督経験値":50, "艦娘経験値":70, 
                        "燃":420, "弾":"-", "鋼":200, "ボ":"-", "報酬":["家具箱小1", "-"], "消費燃":"80%", "消費弾":"80%"
                }
            },
            "遠洋潜水艦作戦":
            {
                "基本":{"旗艦Lv":3, "必要隻数":5, "必要艦種":"潜母艦1潜水4、合計Lv180", "ドラム缶":"-"},
                "詳細":{"時間":"30h", "提督経験値":130, "艦娘経験値":160, 
                        "燃":"-", "弾":"-", "鋼":300, "ボ":"-", "報酬":["高速修復材2", "家具箱中1"], "消費燃":"90%", "消費弾":"90%"
                }
            },
            "水上機前線輸送":
            {
                "基本":{"旗艦Lv":25, "必要隻数":6, "必要艦種":"旗艦軽巡1水母2駆逐2、合計Lv150", "ドラム缶":"-"},
                "詳細":{"時間":"6h50m", "提督経験値":60, "艦娘経験値":70, 
                        "燃":300, "弾":300, "鋼":"-", "ボ":100, "報酬":["家具箱小3", "高速修復材1"], "消費燃":"80%", "消費弾":"70%"
                }
            }
        }
    };
